HideCategoryTemporary Method
 Set one category to be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void HideCategoryTemporary(
	ElementId elementId
)
Visual Basic
Public Sub HideCategoryTemporary ( _
	elementId As ElementId _
)
Visual C++
public:
void HideCategoryTemporary(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DBElementId
 Id of the category to be hidden
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  elementId does not correspond to a Category.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →